{
  "posts": [
    {
      "id": "Z12X3d_",
      "title": "Tổng hợp những mẫu áo khoác voan nhẹ nhàng cho mùa Hè",
      "img": "http://res.cloudinary.com/dev7lem1d/image/upload/v1645233069/ilasdcdhiv6xx3njwjhz.jpg",
      "content": "Tổng hợp những mẫu áo khoác voan nhẹ nhàng cho mùa Hè",
      "date": "2022-02-19",
      "desc": "Phong cách thời trang mùa Hè dành cho các cô nàng duyên dáng với thiết kế họa tiết hoa văn nhiệt đới luôn giúp nàng tràn đầy năng lượng và sức sống. Nằm trong danh sách những mẫu áo khoác nữ mùa Hè nổi bật và ấn tượng nhất không thể không kể đến áo khoác voan. Cùng IVY moda tìm hiểu về mẫu áo khoác voan dành cho các nàng theo đuổi phong cách duyên dáng và nữ tính qua bài viết này nhé!"
    },
    {
      "id": "nvpbfbg",
      "title": "Cùng tìm hiểu về sweater và những bộ đồ đậm chất streetwear",
      "img": "http://res.cloudinary.com/dev7lem1d/image/upload/v1645233175/r7h7eoxzykvsyzar7q73.png",
      "content": "Streetwear - phong cách thời trang cá tính phù hợp với những người cá tính mạnh mẽ, cá tính mà đầy thu hút. Nếu bạn đang tìm hiểu về phong cách này thì hãy khám phá ngay qua bài viết dưới đây cùng IVY moda nhé!",
      "date": "2022-02-19",
      "desc": "Phong cách streetwear là sự kết hợp giữa 2 chữ là \"street\" và \"wear\". Từ \"street\" có nghĩa là “đường phố”, từ \"wear\" có nghĩa là “mặc”. Kết hợp 2 từ này lại, streetwear nghĩa là phong cách đường phố mang sự bụi bặm, cá tính đầy thu hút. Hiện nay phong cách streetwear có rất nhiều biến thể khác nhau được cả nam và nữ ưa chuộng. Phong cách này được cá rapper rất mực ưa thích và được sử dụng rộng rãi."
    },
    {
      "title": "Diện đồ cực xinh với áo khoác màu xanh thật phong cách cho nàng",
      "img": "http://res.cloudinary.com/dev7lem1d/image/upload/v1645233266/g1w6rzei5c5xtoaglefa.jpg",
      "content": "Cùng gặp lại gam màu xanh là trong những thiết kế áo khoác nữ giúp nàng trở nên tự tin và nổi bật hơn khi đứng trước đám đông. Cùng IVY moda giúp nàng thêm xinh và thể hiện phong cách, cá tính riêng của mình bằng những mẫu áo khoác màu xanh thời thượng nhất nhé!",
      "date": "2022-02-19",
      "desc": "Mang vẻ đẹp đằm thắm và trang trọng hơn, áo khoác dạ xanh rêu được xem là item cơ bản dành cho cô nàng sành điệu đồng thời đây cũng là mẫu áo khoác nữ trung niên được các quý cô săn lùng nhiều nhất. Không chỉ đẹp bởi sự trẻ trung và sang chảnh, nó còn là item nhẹ nhàng và dễ phối đồ, điều mà các nàng luôn tìm kiếm ở outfit của mình. Áo khoác dạ xanh rêu mix váy trắng cực xinh và tôn dáng dành cho tất cả các cô gái.",
      "id": "mn5BHh6"
    }
  ],
  "catePosts": [ 
    {
      "name": " Đồ Nữ",
      "id": 1
    },
    {
      "name": " Đồ Nam",
      "id": 2
    },
    {
      "name": " Đồ Trẻ Em",
      "id": 3
    }
  ],
  "billDetail": [],
  "users": [
    {
      "email": "admin@gmail.com",
      "password": "$2a$10$fkjIIuLfzwYxJ5FCoEjLI.lfHFEiFaGzweVxybs.jfCY8eB1y2URm",
      "firstname": "Đại",
      "lastname": "Nguyễn",
      "gender": "Nam",
      "streetaddress": "Thái Bình.",
      "id": 1
    },
    {
      "email": "khach@gmail.com",
      "password": "$2a$10$SGRZyG/lvnbi75g5klIsPuX4qkXl0r8CttyAbdESVe5wZBvi4Il3S",
      "firstname": "Trăm",
      "lastname": "Nguyễn",
      "gender": "Nữ",
      "streetaddress": "Hoài Đức, Hà Nội.",
      "id": 2
    },
    {
      "email": "dainxph14951@gmail.com",
      "password": "$2a$10$.kfXsVMbgB6mA3ROC2Ex1esCLHo9zNo.MjkfC0Mw7h1gkLZ7hzd/q",
      "firstname": "Đạixxx",
      "lastname": "Nguyễn",
      "gender": "Nam",
      "streetaddress": "Trịnh Văn Bô",
      "id": 3
    }
  ],
  "products": [
    {
      "id": "-PcNumi",
      "name": "DẠ LÔNG CỪU MS 77M6818",
      "img": "http://res.cloudinary.com/dev7lem1d/image/upload/v1645232549/jqbwmndrf5ri9cccieoc.jpg",
      "price": "500",
      "detail": "Áo khoác dạ cổ 2 ve dài khoét chữ K - chần chỉ nổi viền. Tay áo dài có hàng 4 khuy trang trí. Eo có đai rời cùng màu. 2 túi chéo 2 bên. Kiểu áo này không chỉ ấm áp mà còn khiến bạn dễ phối đồ với rất nhiều kiểu đồ và phụ kiện khác nhau từ quần jean, legging tới giày cao gót hay bốt cao cổ, khăn quàng cổ,…  Với chất liệu áo làm bằng Lông cừu cao cấp, khâu tay 100% với các mũi khâu được khâu tỉ mỉ khéo léo không làm lộ chỉ. Với đặc điểm mềm, mỏng, nhẹ và giữ ấm tuyệt đối. Áo khoác dạ ép lông cừu đã trở thành item không thể thiểu của phái đẹp mỗi khi đông về. Nắm bắt kịp xu hướng cũng như nhu cầu này, IVY moda đã cho ra đời BST áo khoác dạ ép lông cừu khâu tay cao cấp đạt chuẩn với nhiều kiểu dáng, màu sắc cho phái đẹp lựa chọn.  Màu sắc: Nude - Xanh lơ"
    },
    {
      "id": "5FbV1Qs",
      "name": "DẠ LÔNG CỪU MS 77M6818",
      "img": "http://res.cloudinary.com/dev7lem1d/image/upload/v1645232729/wdoajgstyp88ir2jmbdb.jpg",
      "price": "500",
      "detail": "Áo khoác dạ cổ 2 ve dài khoét chữ K - chần chỉ nổi viền. Tay áo dài có hàng 4 khuy trang trí. Eo có đai rời cùng màu. 2 túi chéo 2 bên. Kiểu áo này không chỉ ấm áp mà còn khiến bạn dễ phối đồ với rất nhiều kiểu đồ và phụ kiện khác nhau từ quần jean, legging tới giày cao gót hay bốt cao cổ, khăn quàng cổ,…  Với chất liệu áo làm bằng Lông cừu cao cấp, khâu tay 100% với các mũi khâu được khâu tỉ mỉ khéo léo không làm lộ chỉ. Với đặc điểm mềm, mỏng, nhẹ và giữ ấm tuyệt đối. Áo khoác dạ ép lông cừu đã trở thành item không thể thiểu của phái đẹp mỗi khi đông về. Nắm bắt kịp xu hướng cũng như nhu cầu này, IVY moda đã cho ra đời BST áo khoác dạ ép lông cừu khâu tay cao cấp đạt chuẩn với nhiều kiểu dáng, màu sắc cho phái đẹp lựa chọn.  Màu sắc: Nude - Xanh lơ",
      "catePostId": 1
    },
    {
      "name": "DẠ LÔNG CỪU  MS 77M6817",
      "img": "http://res.cloudinary.com/dev7lem1d/image/upload/v1645233359/wsp4dvqqf8s2xz9exd7w.jpg",
      "price": "500",
      "detail": "\nChi tiết\nBảo quản\nTham khảo size\nÁo khoác dạ cổ 2 ve khoét chữ K. Tay dài. Túi trước có nắp. Có vạt đắp chéo, có 6 khuy phía trước. Dáng áo dài ngang bắp chân. KHÔNG KÈM ĐAI\n\nKiểu dáng sang trọng, màu tinh tế. Dễ phối giày và phụ kiện cùng thời trang mặc phía trong. Với chất liệu áo làm bằng Lông cừu cao cấp, khâu tay 100% với các mũi khâu được khâu tỉ mỉ khéo léo không làm lộ chỉ. Với đặc điểm mềm, mỏng, nhẹ và giữ ấm tuyệt đối. Áo khoác dạ ép lông cừu đã trở thành item không thể thiểu của phái đẹp mỗi khi đông về. Nắm bắt kịp xu hướng cũng như nhu cầu này, IVY moda đã cho ra đời BST áo khoác dạ ép lông cừu khâu tay cao cấp đạt chuẩn với nhiều kiểu dáng, màu sắc cho phái đẹp lựa chọn.\n\nMàu sắc: Xanh Tím Than - Tím Lavender - Đỏ",
      "id": "MfI2xcD",
      "catePostId": 1 
    },
    {
      "name": "QUẦN TÂY NAM KHAKI  MS 22E2895",
      "img": "http://res.cloudinary.com/dev7lem1d/image/upload/v1645449535/ylhpnzra3woyajz0r8og.jpg",
      "price": "500",
      "detail": "Quần dài khaki kiểu dáng Slim, đai quần có đỉa. 2 túi chéo trước, 2 túi sau có khuy cài. Thiết kế tối giản, các chi tiết may tỉ mỉ, tinh tế, mang đến diện mạo chỉn chu, lịch lãm cho người mặc. Cài bằng khóa kéo và khuy cài.\n\nChất liệu Khaki thoáng mát, thấm hút mồ hôi tốt và khả năng giữ bền form dáng sau nhiều lần giặt.\n\nMàu sắc: Đen - Be",
      "id": "N2lM2ph",
      "catePostId": 2
    },
    {
      "name": "ÁO KHOÁC PHAO CỔ MŨ VIỀN LÔNG MS 70K1450",
      "img": "http://res.cloudinary.com/dev7lem1d/image/upload/v1645449643/ph1xefn74swnpx2znztr.jpg",
      "price": "500",
      "detail": "Áo khoác may kiểu chần bông có mũ trùm đầu viền lông, dài tay, bo thun gân co giãn cổ tay. Cài khóa kéo phía trước (bấm khuy bên ngoài), cổ thấp, có mũ trùm đầu. Có 2 túi vuông khuy bấm phía trước.\n\nBên trong nhồi bông dày dặn với phom dáng chuẩn cùng đường may tỉ mỉ. Tính năng giữ nhiệt, chống nước, độ bền cao.\n\nMàu sắc: Nhiều màu",
      "id": "gCv65K5",
      "catePostId": 3
    }
  ]
}